with open('test.py', 'w') as f:
    f.write('working just fine\n')
    f.write('utf-8 is also just working fine. check it out in next line.\nગોપાલગંજ ટ્રિપલ મર્ડર કેસમાં રાજનીતિએ વેગ પકડ્યો છે. રાષ્ટ્રીય જનતા દળ (RJD)ના ધારાસભ્યો સાથે તેજસ્વી યાદવ ગોપાલગંજ જવા શુક્રવાર સવારે 10.05 વાગ્યે ઘર બહાર નિકળ્યા તો તેમની કાર સામે પોલીસ અધિકારીઓ ઉભા રહી ગયા હતા. રાબડી નિવાસ બહાર હાઈ વોલ્ટેજ ડ્રામા ચાલી રહ્યો છે. મોટી સંખ્યામાં પોલીસને અહીં તહેનાત કરાયા છે. તેજસ્વી યાદવે ગોપાલગંજ હત્યાકાંડમાં જેડીયુ ધારાસભ્યની ધરપકડ માંગ કરી છે.')
